1s/ERP/Conf/InformationRegisters/Лико_РаботаНаРезаках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РаботаНаРезаках</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РаботаНаРезаках/Ext/ManagerModule.bsl
Процедура РегистрацияНачалаРаботыСотрудника(РабочийЦентр,Сотрудник) Экспорт  //+Лико m.shenderov 19.08.2022
	Период=ТекущаяДата();
	
	Если Сотрудник <> ТекущийСотрудникНаРЦ(РабочийЦентр) Тогда
		НаборЗаписей = РегистрыСведений.Лико_РаботаНаРезаках.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РабочийЦентр.Установить(РабочийЦентр);
		НаборЗаписей.Отбор.Период.Установить(Период);
		Запись=НаборЗаписей.Добавить();
		Запись.Период=Период;
		Запись.РабочийЦентр=РабочийЦентр;
		Запись.Сотрудник=Сотрудник;
		НаборЗаписей.Записать(); 		
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 19.08.2022


Функция ТекущийСотрудникНаРЦ(РабочийЦентр) //+Лико m.shenderov 19.08.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_РаботаНаРезакахСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.Лико_РаботаНаРезаках.СрезПоследних(, РабочийЦентр = &РабочийЦентр) КАК Лико_РаботаНаРезакахСрезПоследних";
	Запрос.УстановитьПараметр("РабочийЦентр", РабочийЦентр);
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сотрудник;
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 19.08.2022
